{
	"template": [
		{
			"category": "",
			"title": "",
			"level": 0,
			"type": "",
			"frequency": "",
			"action": null,
			"target": null,
			"special": null,
			"attack": null,
			"effect": null,
			"hit": null,
			"miss": null
		}
	],
	"1": [
		{
			"category": "atk",
			"title": "Breath of the White",
			"level": 1,
			"type": "Close-quarters spell",
			"frequency": "Daily",
			"action": null,
			"target": "1d2 nearby enemies in a group; breath weapon",
			"special": "Breath Weapon: For the rest of the battle, roll a d20 at the start of each of your turns; on a 16+, you can use breath of the white dragon that turn if you wish.",
			"attack": "Charisma + Level vs. PD",
			"effect": null,
			"hit": "3d6 + Charisma cold damage.",
			"miss": "Half damage."
		},
		{
			"category": "atk",
			"title": "Burning Hands",
			"level": 1,
			"type": "Close-quarters spell",
			"frequency": "At-Will",
			"action": null,
			"target": "Up to two nearby enemies in a group",
			"special": null,
			"attack": "Charisma + Level vs. PD",
			"effect": null,
			"hit": "1d6 + Charisma fire damage.",
			"miss": null
		},
		{
			"category": "atk",
			"title": "Chaos Bolt",
			"level": 1,
			"type": "Ranged spell",
			"frequency": "At-Will",
			"action": null,
			"target": "One nearby enemy OR one far away enemy with a -2 attack penalty",
			"special": "The first time you use chaos bolt each battle, determine a random energy type. The spell deals that type of damage each time you use it that battle.",
			"attack": "Charisma + Level vs. PD",
			"effect": null,
			"hit": "1d8 + Charisma random energy damage, and if the natural attack roll was even, you gain a chaotic benefit as if you had gathered power.",
			"miss": "Damage equal to your level."
		},
		{
			"category": "atk",
			"title": "Lightning Fork",
			"level": 1,
			"type": "Ranged spell",
			"frequency": "Recharge 16+ after battle",
			"action": null,
			"target": "One nearby enemy; chain spell",
			"special": "Chain Spell: Each time you make a natural even attack roll, you can attack a different target with the spell.",
			"attack": "Charisma + Level vs. PD",
			"effect": null,
			"hit": "3d6 + Charisma lightning damage.",
			"miss": "Half damage."
		},
		{
			"category": "def",
			"title": "Resist Energy",
			"level": 1,
			"type": "Ranged spell",
			"frequency": "Recharge 16+ after battle",
			"action": null,
			"target": "You or one nearby ally",
			"special": null,
			"attack": null,
			"effect": "Until the end of the battle, the target gains resist damage 12+ to the following energy type of your choice: cold, fire, lightning, thunder.",
			"hit": null,
			"miss": null
		},
		{
			"category": "atk",
			"title": "Scorching Ray",
			"level": 1,
			"type": "Ranged spell",
			"frequency": "At-Will",
			"action": null,
			"target": "One nearby enemy",
			"special": null,
			"attack": "Charisma + Level vs. PD",
			"effect": null,
			"hit": "1d6 + Charisma fire damage, and if the natural attack roll is even, the target also takes 1d8 ongoing fire damage.",
			"miss": "Damage equal to your level."
		}
	],
	"3": [
		{
			"category": "atk",
			"title": "Breath of the Green",
			"level": 3,
			"type": "Close-quarters spell",
			"frequency": "Daily",
			"action": null,
			"target": "1d4 nearby enemies in a group; breath weapon",
			"special": "Breath Weapon: For the rest of the battle, roll a d20 at the start of each of your turns; on a 16+, you can use breath of the green that turn if you wish.",
			"attack": "Charisma + Level vs. PD",
			"effect": null,
			"hit": "15 + Charisma ongoing poison damage.",
			"miss": "5 ongoing poison damage."
		},
		{
			"category": "atk",
			"title": "Chaos Pulse",
			"level": 3,
			"type": "Ranged spell",
			"frequency": "At-Will",
			"action": null,
			"target": "One random nearby enemy",
			"special": null,
			"attack": "Charisma + Level vs. PD",
			"effect": null,
			"hit": "3d10 + Charisma random energy damage.",
			"miss": "Even Miss: Half damage.\nOdd Miss: Damage equal to your level."
		},
		{
			"category": "def",
			"title": "Dragon's Leap",
			"level": 3,
			"type": "Ranged spell",
			"frequency": "Daily",
			"action": "Quick action to cast",
			"target": "You; breath weapon",
			"special": "Breath Weapon: For the rest of the battle, roll a d20 at the start of each of your turns; on a 16+, you can use dragon's leap this turn if you wish. (Yeah, we know it's not actually a breath weapon, but it works as part of the draconic sorcerer package.)",
			"attack": null,
			"effect": "You can fly at the rate you normally move until the end of your turn. (So if you don't land or find someplace to hang from, you'll fall.)",
			"hit": null,
			"miss": null
		},
		{
			"category": "atk",
			"title": "Echoing Thunder",
			"level": 3,
			"type": "Ranged spell",
			"frequency": "At-Will",
			"action": null,
			"target": "One nearby enemy",
			"special": null,
			"attack": "Charisma + Level vs. PD",
			"effect": null,
			"hit": "3d6 + Charisma thunder damage, and the first enemy that hits you with a melee attack before the start of your next turn takes 2d6 thunder damage. (An empowered spell does not double this aftershock damage.)",
			"miss": "Damage equal to your level."
		}
	],
	"5": [
		{
			"category": "atk",
			"title": "Breath of the Black",
			"level": 5,
			"type": "Close-quarters spell",
			"frequency": "Daily",
			"action": null,
			"target": "One nearby enemy; breath weapon",
			"special": "Breath Weapon: For the rest of the battle, roll a d20 at the start of each of your turns; on a 16+, you can use breath of the black that turn if you wish.",
			"attack": "Charisma + Level vs. MD",
			"effect": null,
			"hit": "10d6 + Charisma acid damage, and 20 ongoing acid damage.",
			"miss": "10 ongoing acid damage."
		},
		{
			"category": "atk",
			"title": "The Queen's Shadows",
			"level": 5,
			"type": "Ranged spell",
			"frequency": "Daily",
			"action": null,
			"target": "One nearby enemy",
			"special": "Once you cast this spell in a battle, you can cast it at- will for the rest of that battle.",
			"attack": "Charisma + Level vs. MD",
			"effect": null,
			"hit": "8d6 + Charisma psychic damage, and if the natural attack roll is even, you can teleport to a nearby location you can see.",
			"miss": "Damage equal to your level."
		},
		{
			"category": "atk",
			"title": "Three Dooms",
			"level": 5,
			"type": "Ranged spell",
			"frequency": "Recharge 16+ after battle",
			"action": null,
			"target": "One nearby enemy; chain spell",
			"special": "Chain Spell: Each time you make a natural even attack roll, you can attack a different target with the spell.",
			"attack": "Charisma + Level vs. PD",
			"effect": null,
			"hit": "2d4 x 10 random energy damage, and you take damage of the same type equal to the unmodified dice roll (2d4, 2d8, or 2d12). (Note that there's no Charisma bonus to damage.)",
			"miss": "Half damage, and you still take random energy damage equal to the unmodified dice roll."
		},
		{
			"category": "def",
			"title": "Unearthly Glamour",
			"level": 5,
			"type": "Ranged spell",
			"frequency": "Daily",
			"action": null,
			"target": null,
			"special": null,
			"attack": null,
			"effect": "You gain a +5 bonus to all Charisma skill checks for the next five minutes. If you fail a Charisma skill check during this time, however, anyone you were attempting to convince or influence with the check is freaked out or disgusted by the supernatural glamour attached to you and has extremely negative reactions to you.",
			"hit": null,
			"miss": null
		}
	],
	"7": [
		{
			"category": "atk",
			"title": "Breath of the Blue",
			"level": 7,
			"type": "Close-quarters spell",
			"frequency": "Daily",
			"action": null,
			"target": "One nearby enemy; breath spell",
			"special": "Breath Spell: For the rest of the battle, roll a d20 at the start of each of your turns; on a 16+, you can use breath of the blue this turn if you wish.",
			"attack": "Charisma + Level vs. PD",
			"effect": null,
			"hit": "10d12 + Charisma lightning damage, and at the start of the target's next turn, 1d6 of its nearby allies take 20 lightning damage.",
			"miss": "Half damage, and no damage to target's allies."
		},
		{
			"category": "def",
			"title": "Stolen Faces",
			"level": 7,
			"type": "Ranged spell",
			"frequency": "Daily",
			"action": "Free action to cast, before initiative is rolled",
			"target": "1d4 + 1 nearby allies",
			"special": null,
			"attack": null,
			"effect": "You steal the once-per-battle racial powers of your allies this battle, but you don't get the advantage of your allies' feats or items that improve those powers.\nWe say you “steal” the power because you aren't asking permission. Each ally you steal a racial power from can roll an easy save (6+). Success means they get to use their power also this battle. Failure means they can't; you took it fully.",
			"hit": null,
			"miss": null
		},
		{
			"category": "def",
			"title": "Touch of Evil",
			"level": 7,
			"type": "Close-quarters spell",
			"frequency": "Daily",
			"action": "Quick action to cast",
			"target": "You",
			"special": "Using this spell when you're actually fighting demons could be unwise. If you are fighting one or more demons, roll an easy save (6+) at the start of each of your turns. Failure means that you are confused that turn.",
			"attack": null,
			"effect": "You gain a random demon-style power for the rest of the battle, similar to the abilities demons possess but not identical.\nRoll a d8 to see which power you gain:\n1: Resist energy 16+ — When an attack that deals energy damage targets you, the attacker must roll a natural 16+ on the attack roll or it only deals half damage.\n2: Infernal battery — Until the end of the battle, you can use a quick action once each round to make recharge rolls for your expended recharge spells. Each time you do so, you take damage equal to half the natural result of your recharge roll.\n3: Backlash — The first time you are staggered this battle, the enemy who staggered you becomes confused (save ends).\n4: Spell frenzy — You enter a spell frenzy (see Infernal Heritage talent). If you were already in a spell frenzy, you now roll 3d20 for each attack and take damage equal to triple the target's level for each roll that misses.\n5: Fear aura — Enemies engaged with you that have fewer hit points than double your current hit points are dazed. In the unlikely event that they could normally use the escalation die, well, they can't.\n6: Teleport 1d3 + 1 times this battle — As a move action, you can teleport anywhere you can see nearby.\n7: Demonic speed — You can take an extra standard action each turn that the escalation die is even. You lose 2d10 hit points each time you use the extra action.\n8: Eye of the Diabolist — Choose any two features you want! Yeah! Enjoy. For the rest of this day, all your icon relationships disappear and are replaced by an identical number of conflicted points with the Diabolist. Consider this a love letter to the GM.",
			"hit": null,
			"miss": null
		}
	],
	"9": [
		{
			"category": "atk",
			"title": "Breath of the Void",
			"level": 9,
			"type": "Close-quarters spell",
			"frequency": "Daily",
			"action": null,
			"target": "One nearby enemy; breath spell",
			"special": "Breath Spell: For the rest of the battle, roll a d20 at the start of each of your turns; on a 16+, you can use breath of the void this turn if you wish.",
			"attack": "Charisma + Level vs. MD",
			"effect": null,
			"hit": "2d12 x 10 + Charisma negative energy damage, and the target moves down 2d6 points in initiative order, to a minimum of 1.",
			"miss": "Half damage."
		},
		{
			"category": "def",
			"title": "Calling the Blood",
			"level": 9,
			"type": "Close-quarters spell",
			"frequency": "Daily",
			"action": null,
			"target": null,
			"special": null,
			"attack": null,
			"effect": "Roll a d6 to randomly select one of the six sorcerous-heritage icons:\n1: Archmage\n2: The Three\n3: Diabolist\n4: Elf Queen\n5: Great Gold Wyrm\n6: Lich King\nYou gain some surprising or bizarre magical effect associated with the power of that icon to assist you. The effect is entirely up to the GM, though the immediate impact of the spell should always be favorable for you. The long-term consequences of randomly invoking the power of an icon that may be an enemy might not be favorable for you, and should be played for narrative interest by the GM, particularly if the impact of the spell was huge for you. Since this is a daily spell, sizeable impact is fine, but don't award any extra effect for empowered casting, especially since the spell can be cast effectively out of combat.",
			"hit": null,
			"miss": null
		},
		{
			"category": "def",
			"title": "Silver Flame",
			"level": 9,
			"type": "Close-quarters spell",
			"frequency": "Daily",
			"action": "Quick action to cast",
			"target": null,
			"special": null,
			"attack": null,
			"effect": "Roll your relationship dice with the Archmage; if you have none, avoid this spell.\nFor each 6 you roll, you gain one 7th level or lower spell from any spellcasting class that you can cast this battle. For each 5 you roll, you gain one 5th level or lower spell from any spellcasting class that you can cast this battle.\nIf the escalation die is 5+, you can swap the escalation die for one or your rolls. If you get no successes, you regain the spell after this battle.\nYou can acquire one of the new spells the same round you cast this spell. Then select and acquire any other gained spells at the start of your next turn, so if you haven't already figured out what you will take, get to work. If you haven't figured it out by your next turn, the GM should move play on without your decision and consider letting you trickle in the spells as you figure it out.\nYou can use your Charisma as the ability score that provides the acquired spells' attack bonuses and damage bonuses (if any). Other ability score references remain unchanged.\nAs you might expect, each 5 you roll also invokes an Archmage-related complication or obligation in the tradition of rolling 5s on relationship checks. The GM should have as much fun with you as possible.",
			"hit": null,
			"miss": null
		}
	]
}